#### [`repos-official-new`] Terraform Plan 📖`success`

<a href="https://app.terraform.io/app/cdktf-team/prebuilt-providers-official-new/runs/run-t7PwLhjdj2mMXrTS" target="_blank">Remote Plan Link ↗️</a>

<details><summary>Show Plan</summary>

```tf
[command]/home/runner/work/_temp/5f242afe-1643-45ce-8825-a7bb796d3102/terraform-bin plan -no-color
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/cdktf-team/prebuilt-providers-official-new/runs/run-t7PwLhjdj2mMXrTS

Waiting for the plan to start...

Terraform v1.3.1
on linux_amd64
Initializing plugins and modules...
data.github_team.reposofficialnew_cdktfteamcdktf_4A2C9F8E: Reading...
data.github_team.reposofficialnew_cdktfteamcdktf_4A2C9F8E: Read complete after 8s [id=6602018]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_actions_secret.reposofficialnew_cdktfproviderwaypoint_repo_secretalertprsslackwebhookurl_4580EA5E will be created
  + resource "github_actions_secret" "reposofficialnew_cdktfproviderwaypoint_repo_secretalertprsslackwebhookurl_4580EA5E" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-waypoint"
      + secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.reposofficialnew_cdktfproviderwaypoint_repo_secretghtoken_881A69A3 will be created
  + resource "github_actions_secret" "reposofficialnew_cdktfproviderwaypoint_repo_secretghtoken_881A69A3" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-waypoint"
      + secret_name     = "GH_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.reposofficialnew_cdktfproviderwaypoint_repo_secretghtokenaliasGOGITHUBTOKEN_14882299 will be created
  + resource "github_actions_secret" "reposofficialnew_cdktfproviderwaypoint_repo_secretghtokenaliasGOGITHUBTOKEN_14882299" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-waypoint"
      + secret_name     = "GO_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.reposofficialnew_cdktfproviderwaypoint_repo_secretghtokenaliasPROJENGITHUBTOKEN_09BA91C6 will be created
  + resource "github_actions_secret" "reposofficialnew_cdktfproviderwaypoint_repo_secretghtokenaliasPROJENGITHUBTOKEN_09BA91C6" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-waypoint"
      + secret_name     = "PROJEN_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.reposofficialnew_cdktfproviderwaypoint_repo_secretmavengpgprivatekey_EED6C9DA will be created
  + resource "github_actions_secret" "reposofficialnew_cdktfproviderwaypoint_repo_secretmavengpgprivatekey_EED6C9DA" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-waypoint"
      + secret_name     = "MAVEN_GPG_PRIVATE_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.reposofficialnew_cdktfproviderwaypoint_repo_secretmavengpgprivatekeypassphrase_ECEA8726 will be created
  + resource "github_actions_secret" "reposofficialnew_cdktfproviderwaypoint_repo_secretmavengpgprivatekeypassphrase_ECEA8726" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-waypoint"
      + secret_name     = "MAVEN_GPG_PRIVATE_KEY_PASSPHRASE"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.reposofficialnew_cdktfproviderwaypoint_repo_secretmavenpassword_800D43B2 will be created
  + resource "github_actions_secret" "reposofficialnew_cdktfproviderwaypoint_repo_secretmavenpassword_800D43B2" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-waypoint"
      + secret_name     = "MAVEN_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.reposofficialnew_cdktfproviderwaypoint_repo_secretmavenstagingprofileid_7368BF7E will be created
  + resource "github_actions_secret" "reposofficialnew_cdktfproviderwaypoint_repo_secretmavenstagingprofileid_7368BF7E" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-waypoint"
      + secret_name     = "MAVEN_STAGING_PROFILE_ID"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.reposofficialnew_cdktfproviderwaypoint_repo_secretmavenusername_A64C4F34 will be created
  + resource "github_actions_secret" "reposofficialnew_cdktfproviderwaypoint_repo_secretmavenusername_A64C4F34" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-waypoint"
      + secret_name     = "MAVEN_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.reposofficialnew_cdktfproviderwaypoint_repo_secretnpmtoken_9B363A72 will be created
  + resource "github_actions_secret" "reposofficialnew_cdktfproviderwaypoint_repo_secretnpmtoken_9B363A72" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-waypoint"
      + secret_name     = "NPM_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.reposofficialnew_cdktfproviderwaypoint_repo_secretnugetapikey_BC464AC4 will be created
  + resource "github_actions_secret" "reposofficialnew_cdktfproviderwaypoint_repo_secretnugetapikey_BC464AC4" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-waypoint"
      + secret_name     = "NUGET_API_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.reposofficialnew_cdktfproviderwaypoint_repo_secrettwinepassword_EE2888C1 will be created
  + resource "github_actions_secret" "reposofficialnew_cdktfproviderwaypoint_repo_secrettwinepassword_EE2888C1" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-waypoint"
      + secret_name     = "TWINE_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.reposofficialnew_cdktfproviderwaypoint_repo_secrettwineusername_ED37F3AD will be created
  + resource "github_actions_secret" "reposofficialnew_cdktfproviderwaypoint_repo_secrettwineusername_ED37F3AD" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-waypoint"
      + secret_name     = "TWINE_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_branch_protection.reposofficialnew_cdktfproviderwaypoint_repositorysetup_mainprotection_9AF3484C will be created
  + resource "github_branch_protection" "reposofficialnew_cdktfproviderwaypoint_repositorysetup_mainprotection_9AF3484C" {
      + allows_deletions       = false
      + allows_force_pushes    = false
      + enforce_admins         = true
      + id                     = (known after apply)
      + pattern                = "main"
      + repository_id          = "cdktf-provider-waypoint"
      + require_signed_commits = false

      + required_status_checks {
          + contexts = [
              + "Validate PR title",
              + "build",
              + "package-dotnet",
              + "package-go",
              + "package-java",
              + "package-js",
              + "package-python",
            ]
          + strict   = true
        }
    }

  # github_issue_label.reposofficialnew_cdktfproviderwaypoint_repositorysetup_automergelabel_CE7198A1 will be created
  + resource "github_issue_label" "reposofficialnew_cdktfproviderwaypoint_repositorysetup_automergelabel_CE7198A1" {
      + color      = "5DC8DB"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "automerge"
      + repository = "cdktf-provider-waypoint"
      + url        = (known after apply)
    }

  # github_issue_label.reposofficialnew_cdktfproviderwaypointgo_repositorysetup_automergelabel_1DD9812C will be created
  + resource "github_issue_label" "reposofficialnew_cdktfproviderwaypointgo_repositorysetup_automergelabel_1DD9812C" {
      + color      = "5DC8DB"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "automerge"
      + repository = "cdktf-provider-waypoint-go"
      + url        = (known after apply)
    }

  # github_repository.reposofficialnew_cdktfproviderwaypoint_repo_88065F9C will be created
  + resource "github_repository" "reposofficialnew_cdktfproviderwaypoint_repo_88065F9C" {
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + auto_init              = true
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "Prebuilt Terraform CDK (cdktf) provider for waypoint."
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + has_issues             = true
      + has_projects           = false
      + has_wiki               = false
      + homepage_url           = "https://cdk.tf"
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "cdktf-provider-waypoint"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + topics                 = [
          + "cdk",
          + "cdktf",
          + "pre-built-provider",
          + "provider",
          + "terraform",
          + "terraform-cdk",
          + "waypoint",
        ]
      + visibility             = "public"
    }

  # github_repository.reposofficialnew_cdktfproviderwaypointgo_repo_A9252B7B will be created
  + resource "github_repository" "reposofficialnew_cdktfproviderwaypointgo_repo_A9252B7B" {
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + auto_init              = true
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "CDK for Terraform Go provider bindings for waypoint."
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + has_issues             = false
      + has_projects           = false
      + has_wiki               = false
      + homepage_url           = "https://cdk.tf"
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "cdktf-provider-waypoint-go"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + topics                 = [
          + "cdk",
          + "cdktf",
          + "pre-built-provider",
          + "provider",
          + "terraform",
          + "terraform-cdk",
          + "waypoint",
        ]
      + visibility             = "public"
    }

  # github_repository_webhook.reposofficialnew_cdktfproviderwaypoint_repositorysetup_slackwebhook_86D75F62 will be created
  + resource "github_repository_webhook" "reposofficialnew_cdktfproviderwaypoint_repositorysetup_slackwebhook_86D75F62" {
      + active     = true
      + etag       = (known after apply)
      + events     = [
          + "issues",
        ]
      + id         = (known after apply)
      + repository = "cdktf-provider-waypoint"
      + url        = (known after apply)

      + configuration {
          + content_type = "json"
          + url          = (sensitive value)
        }
    }

  # github_repository_webhook.reposofficialnew_cdktfproviderwaypointgo_repositorysetup_slackwebhook_6A0976E4 will be created
  + resource "github_repository_webhook" "reposofficialnew_cdktfproviderwaypointgo_repositorysetup_slackwebhook_6A0976E4" {
      + active     = true
      + etag       = (known after apply)
      + events     = [
          + "issues",
        ]
      + id         = (known after apply)
      + repository = "cdktf-provider-waypoint-go"
      + url        = (known after apply)

      + configuration {
          + content_type = "json"
          + url          = (sensitive value)
        }
    }

  # github_team_repository.reposofficialnew_cdktfproviderwaypoint_repositorysetup_managingteam_029C33D8 will be created
  + resource "github_team_repository" "reposofficialnew_cdktfproviderwaypoint_repositorysetup_managingteam_029C33D8" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "cdktf-provider-waypoint"
      + team_id    = "6602018"
    }

  # github_team_repository.reposofficialnew_cdktfproviderwaypointgo_repositorysetup_managingteam_C1AECE70 will be created
  + resource "github_team_repository" "reposofficialnew_cdktfproviderwaypointgo_repositorysetup_managingteam_C1AECE70" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "cdktf-provider-waypoint-go"
      + team_id    = "6602018"
    }

Plan: 22 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ reposofficialnew_providerRepos_9F1CE2EB = [
        # (13 unchanged elements hidden)
        "git@github.com:cdktf/cdktf-provider-vsphere.git",
      + (known after apply),
    ]
::debug::Terraform exited with code 0.
::debug::stderr: 
::debug::exitcode: 0

```

</details>

*Pusher: @xiehan, Action: `pull_request`, Working Directory: ``, Workflow: `Plan`*